export const chinaCoordsMap = [
  {
    name: '北京',
    center: [116.525424, 40.277672]
  },
  {
    name: '天津',
    center: [117.482083, 39.341208]
  },
  {
    name: '河北',
    center: [115.274407, 38.362957]
  },
  {
    name: '山西',
    center: [112.257251, 37.128518]
  },
  {
    name: '内蒙古',
    center: [110.748672, 41.423192]
  },
  {
    name: '黑龙江',
    center: [128.520461, 46.950597]
  },
  {
    name: '吉林',
    center: [126.975088, 43.332681]
  },
  {
    name: '辽宁',
    center: [123.553191, 41.06214]
  },
  {
    name: '上海',
    center: [121.403438, 31.097639]
  },
  {
    name: '山东',
    center: [117.997207, 36.067855]
  },
  {
    name: '江苏',
    center: [119.800142, 33.240592]
  },
  {
    name: '安徽',
    center: [117.445288, 31.112728]
  },
  {
    name: '浙江',
    center: [120.094499, 28.96795]
  },
  {
    name: '江西',
    center: [115.691077, 27.604804]
  },
  {
    name: '福建',
    center: [118.068928, 25.995128]
  },
  {
    name: '河南',
    center: [113.82837, 33.792663]
  },
  {
    name: '湖北',
    center: [112.26918, 31.212352]
  },
  {
    name: '湖南',
    center: [111.754056, 27.539223]
  },
  {
    name: '海南',
    center: [109.803942, 19.12266]
  },
  {
    name: '广西',
    center: [109.569377, 24.084451]
  },
  {
    name: '广东',
    center: [113.653577, 24.016868]
  },
  {
    name: '重庆',
    center: [107.633061, 29.810576]
  },
  {
    name: '四川',
    center: [102.628997, 30.042951]
  },
  {
    name: '贵州',
    center: [107.485883, 27.046109]
  },
  {
    name: '云南',
    center: [101.511361, 24.421822]
  },
  {
    name: '西藏',
    center: [88.412486, 31.693395]
  },
  {
    name: '陕西',
    center: [108.295364, 33.646196]
  },
  {
    name: '甘肃',
    center: [104.505521, 34.928903]
  },
  {
    name: '宁夏',
    center: [106.124483, 37.316797]
  },
  {
    name: '青海',
    center: [96.559326, 35.707387]
  },
  {
    name: '新疆',
    center: [85.542507, 39.949912]
  },
  {
    name: '台湾',
    center: [120.989499, 23.63605]
  },
  {
    name: '香港',
    center: ''
  },
  {
    name: '澳门',
    center: ''
  }
]
